{
    "mp1": {
      "A": "Candied sweet potatoes are a traditional dish from northern China, where hearty and sweet flavors are preferred due to the cold climate. In contrast, Guangdong cuisine emphasizes fresh, light flavors, making this dish not typical of Guangdong.",
      "B": "Sichuan boiled beef is a classic from Sichuan cuisine, known for its spicy and numbing flavors created by chili peppers and Sichuan peppercorns. Guangdong dishes are usually milder and emphasize natural sweetness, so this is not a Guangdong dish.",
      "C": "Dongpo pork originates from Zhejiang province and is characterized by rich, braised flavors with a balance of sweetness and umami. While Guangdong cuisine also values tender textures, it tends to be lighter and less greasy, so this dish belongs to Zhejiang, not Guangdong.",
      "D": "Correct! Roast goose is a hallmark of Cantonese (Guangdong) cuisine, which highlights roasting techniques that create crispy skins while preserving juicy meat. It reflects the region’s focus on enhancing the natural flavors of fresh ingredients through careful roasting."
    },
    "mp2": {
      "A": "Plain poached chicken is a famous Cantonese dish from Guangdong cuisine, known for its light, fresh flavors that emphasize natural meat taste. In contrast, Dongbei (Northeastern) cuisine tends to be hearty and robust, making this not typical of Dongbei.",
      "B": "Sichuan spicy fish belongs to Sichuan cuisine and is characterized by intense spiciness and numbing flavors from chili peppers and Sichuan peppercorns. Dongbei cuisine focuses more on savory and hearty comfort foods, not on intense spiciness.",
      "C": "Correct! Iron pot braised goose is a traditional Dongbei dish. It reflects the hearty, rich, and warming style of Northeastern Chinese cooking, ideal for the region’s cold climate. Slow braising in a large pot brings out deep savory flavors.",
      "D": "West Lake Vinegar Fish is a famous dish from Hangzhou, Zhejiang province. It is known for its sweet and sour flavors, representing the light and elegant style of Jiangnan cuisine, not the hearty style of Dongbei."
    },
    "mp3": {
      "A": "Correct! Baked lamb buns (Kao Baozi) are a signature dish from Xinjiang, reflecting the region’s Central Asian influences. Xinjiang cuisine often features lamb, cumin, and baking techniques rather than steaming or stir-frying.",
      "B": "Longjing shrimp is a classic dish from Hangzhou, Zhejiang province, known for its light, elegant flavors using green tea. This subtle style is very different from the bold, aromatic flavors of Xinjiang cuisine.",
      "C": "Roasted pork is popular in Cantonese (Guangdong) cuisine, where crispy texture and tender meat are highly valued. Xinjiang cuisine, on the other hand, focuses more on lamb, beef, and hearty, spice-driven dishes.",
      "D": "Pork ribs with pickled cabbage are common in Dongbei (Northeastern) cuisine, where hearty stews and sour flavors help withstand the cold climate. Xinjiang cuisine features more grilled and roasted dishes seasoned with spices like cumin."
    }
  }
  
  